Repository: tron90x/Secure-Note-App
Catalog: lib/l10n/app_*.arb
Languages: fr, kab

# appTitle
source: Secure Note App
fr: Application de Notes Sécurisée
kab: Asnas n Tira Yettwamlen

# appSubtitle
source: Your private thoughts, securely stored.
fr: Vos pensées privées, stockées en toute sécurité.
kab: Iɣmisen-ik/ikem tuffɣa, ttwaḥerzen s tɣellist.

source: Application Error
fr: Erreur d'Application
kab: Tuccḍa n Usnas

# unknownErrorOccurred
source: An unknown error has occurred. The application needs to be closed.
fr: Une erreur inconnue s'est produite. L'application doit être fermée.
kab: Tuccḍa tarussint teḍra. Asnas ilaq ad yettwamdel.

source: Close Application
fr: Fermer l'Application
kab: Mdel Asnas

# chooseStorageMode
source: Choose your storage mode:
fr: Choisissez votre mode de stockage :
kab: Fren anaw n uḥerzi:

source: Use Native Secure Storage
fr: Utiliser le Stockage Sécurisé Natif
kab: Seqdec Aḥerzi Amzun Yettwamlen

source: Use Rust Database
fr: Utiliser la Base de Données Rust
kab: Seqdec Taffa n Yisefka Rust

# nativeStorageConfigured
source: Native storage is configured.
fr: Le stockage natif est configuré.
kab: Aḥerzi amzun yettwasewḍen.

source: Native storage needs setup.
fr: Le stockage natif nécessite une configuration.
kab: Aḥerzi amzun yesra asewḍi.

source: Unlock Native Storage
fr: Déverrouiller le Stockage Natif
kab: Rmed Aḥerzi Amzun

# enterPasswordNativeStorage
source: Enter password for native storage:
fr: Entrez le mot de passe pour le stockage natif :
kab: Sekcem awal n uɛeddi i uḥerzi amzun:

source: Password
fr: Mot de passe
kab: Awal n uɛeddi

source: Unlock
fr: Déverrouiller
kab: Rmed

source: Invalid password.
fr: Mot de passe invalide.
kab: Awal n uɛeddi aruɣan.

# failedToUnlock
source: Failed to unlock: {error}
fr: Échec du déverrouillage : {error}
kab: Ur yeddi ara rmed: {error}

source: Native Categories
fr: Catégories Natives
kab: Taggayin Amzunen

source: Search notes...
fr: Rechercher des notes...
kab: Nadi tira...

# enterSearchTerm
source: Enter a search term
fr: Entrez un terme de recherche
kab: Sekcem awalen n unadi

source: No results found
fr: Aucun résultat trouvé
kab: Ulac igmumen

source: No native categories yet.
fr: Aucune catégorie native pour le moment.
kab: Ulac taggayin amzunen s tura.

source: Create New Native Category
fr: Créer une Nouvelle Catégorie Native
kab: Rnu Taggayt Tamaynut Amzun

source: Category Name
fr: Nom de la Catégorie
kab: Isem n Taggayt

source: Cancel
fr: Annuler
kab: Sefsex

source: Create
fr: Créer
kab: Rnu

source: Open Rust Database
fr: Ouvrir la Base de Données Rust
kab: Ldi Taffa n Yisefka Rust

# selectRustDatabaseFiles
source: Select your Rust application's database file and validation file, then enter the password.
fr: Sélectionnez le fichier de base de données de votre application Rust et le fichier de validation, puis entrez le mot de passe.
kab: Fren afaylu n taffa n yisefka n usnas-ik Rust d afaylu n usentem, sinna sekcem awal n uɛeddi.

# step1SelectDatabaseFile
source: Step 1: Select Database File (.sqlite)
fr: Étape 1 : Sélectionner le Fichier de Base de Données (.sqlite)
kab: Tasertit 1: Fren Afaylu n Taffa n Yisefka (.sqlite)

source: Browse for SQLite File
fr: Parcourir pour le Fichier SQLite
kab: Snirem i Afaylu SQLite

# step2SelectValidationFile
source: Step 2: Select Validation File (.dat)
fr: Étape 2 : Sélectionner le Fichier de Validation (.dat)
kab: Tasertit 2: Fren Afaylu n Usentem (.dat)

# browseForValidationFile
source: Browse for validation.dat
fr: Parcourir pour validation.dat
kab: Snirem i validation.dat

source: Step 3: Enter Password
fr: Étape 3 : Entrer le Mot de Passe
kab: Tasertit 3: Sekcem Awal n uɛeddi

# enterDatabasePassword
source: Enter your database password
fr: Entrez votre mot de passe de base de données
kab: Sekcem awal n uɛeddi n taffa n yisefka

source: Open Database
fr: Ouvrir la Base de Données
kab: Ldi Taffa n Yisefka

# selectRustDatabaseFile
source: Please select the Rust SQLite database file.
fr: Veuillez sélectionner le fichier de base de données SQLite Rust.
kab: Ttxil-k fren afaylu n taffa n yisefka SQLite Rust.

# selectValidationFile
source: Please select the validation.dat file.
fr: Veuillez sélectionner le fichier validation.dat.
kab: Ttxil-k fren afaylu validation.dat.

# enterPassword
source: Please enter the password.
fr: Veuillez entrer le mot de passe.
kab: Ttxil-k sekcem awal n uɛeddi.

source: Validating password...
fr: Validation du mot de passe...
kab: Asentem n wawal n uɛeddi...

# passwordValidated
source: Password validated! Opening database...
fr: Mot de passe validé ! Ouverture de la base de données...
kab: Awal n uɛeddi yettwaseqdec! Ldi taffa n yisefka...

# passwordValidationFailed
source: Password validation failed. Incorrect password or corrupted validation file.
fr: La validation du mot de passe a échoué. Mot de passe incorrect ou fichier de validation corrompu.
kab: Asentem n wawal n uɛeddi ur yeddi ara. Awal n uɛeddi aruɣan neɣ afaylu n usentem yettwaɣerzen.

# failedToOpenRustDb
source: Failed to open Rust DB with service: {error}
fr: Échec de l'ouverture de la base de données Rust avec le service : {error}
kab: Ur yeddi ara ldi taffa n yisefka Rust s uxeddim: {error}

# error
source: Error: {error}
fr: Erreur : {error}
kab: Tuccḍa: {error}

source: Language
fr: Langue
kab: Tutlayt

source: Select Language
fr: Sélectionner la Langue
kab: Fren Tutlayt

# french
source: Fran√ßais
fr: Français
kab: Français

# nativeOptionsTitle
source: Native Secure Storage Options
fr: Options de stockage sécurisé natif
kab: Iɣewwaren n uḥerzi amzun

source: Create or Open Default Database
fr: Créer ou ouvrir la base par défaut
kab: Rnu neɣ ldi taffa n yisefka tamezwarut

source: Open Existing Database
fr: Ouvrir une base existante
kab: Ldi taffa n yisefka yellan

source: Create New Database
fr: Créer une nouvelle base
kab: Rnu taffa n yisefka tamaynut

# selectedDirMissingPrefs
source: Selected directory does not contain shared_preferences.json
fr: Le dossier sélectionné ne contient pas shared_preferences.json
kab: akaram i yettwafernen ur yesɛi ara shared_preferences.json

# noDbFileFound
source: No database file (.db) found in the selected directory
fr: Aucun fichier base de données (.db) trouvé dans le dossier sélectionné
kab: Ulac afaylu n taffa n yisefka (.db) deg ukaram i yettwafernen

# databaseCreatedTitle
source: Database Created
fr: Base de données créée
kab: Taffa n yisefka tettwarna

# openNewDatabaseQuestion
source: Would you like to open the newly created database?
fr: Voulez-vous ouvrir la base nouvellement créée ?
kab: Tebɣiḍ ad teldiḍ taffa n yisefka tettwarna tura?

# openDatabaseAction
source: Open Database
fr: Ouvrir la base
kab: Ldi taffa n yisefka

source: Back to Options
fr: Retour aux options
kab: Uɣal ɣer iɣewwaren

# createPasswordForCustomDatabaseTitle
source: Create Password for Custom Database
fr: Créer un mot de passe pour la base personnalisée
kab: Rnu awal n uɛeddi i taffa n yisefka yugnen

# createSecurePasswordTitle
source: Create Secure Password
fr: Créer un mot de passe sécurisé
kab: Rnu awal n uɛeddi aɣellsan

# createPasswordLead
source: Create a password to secure your notes
fr: Créez un mot de passe pour sécuriser vos notes
kab: Rnu awal n uɛeddi i usekles n tazmilt-ik

# createPasswordLeadCustom
source: Create a password for your new database
fr: Créez un mot de passe pour votre nouvelle base
kab: Rnu awal n uɛeddi i taffa-ik n yisefka tamaynut

# passwordLabel
source: Password
fr: Mot de passe
kab: Awal n uɛeddi

# passwordHint
source: Enter your password
fr: Entrez votre mot de passe
kab: Sekcem awal-ik n uɛeddi

# confirmPasswordLabel
source: Confirm Password
fr: Confirmez le mot de passe
kab: Sentem awal n uɛeddi

# confirmPasswordHint
source: Re-enter your password
fr: Saisissez à nouveau votre mot de passe
kab: Ales asekcem n wawal n uɛeddi

# pleaseEnterPassword
source: Please enter a password
fr: Veuillez saisir un mot de passe
kab: Ttxil-k sekcem awal n uɛeddi

# minPasswordLength
source: Password must be at least 6 characters
fr: Le mot de passe doit contenir au moins 6 caractères
kab: Awal n uɛeddi ilaq ad yegber 6 n yisekkilen ma drus

# pleaseConfirmPassword
source: Please confirm your password
fr: Veuillez confirmer votre mot de passe
kab: Ttxil-k sentem awal n uɛeddi

source: Passwords do not match
fr: Les mots de passe ne correspondent pas
kab: Awalen n uɛeddi ur mṣadan ara

# passwordCreatedSuccess
source: Password created successfully! Please log in.
fr: Mot de passe créé avec succès ! Veuillez vous connecter.
kab: Awal n uɛeddi yettwarnan akken iwata! Ttxil-k qqen.

# failedToSetPassword
source: Failed to set password. Please try again.
fr: Échec de la création du mot de passe. Veuillez réessayer.
kab: Ur yeddi ara asbadu n wawal n uɛeddi. ɛreḍ tikkelt-nniḍen.

# genericError
source: An error occurred: {error}
fr: Une erreur s'est produite : {error}
kab: Teḍra-d tuccḍa: {error}

source: Previous Month
fr: Mois précédent
kab: Aggur yezrin

source: Next Month
fr: Mois suivant
kab: Aggur d-iteddun

source: No notes for this month
fr: Aucune note pour ce mois
kab: Ulac tizmilin i waggur-agi

source: Add Note
fr: Ajouter une note
kab: Rnu tazmilt

source: Add Note to {category}
fr: Ajouter une note à {category}
kab: Rnu tazmilt ɣer {category}

# noNotesInCategoryForMonth
source: No notes in {category} for {month} {year}.
fr: Aucune note dans {category} pour {month} {year}.
kab: Ulac tizmilin deg {category} i {month} {year}.

source: Add First Note
fr: Ajouter la première note
kab: Rnu tazmilt tamezwarut

source: Note in {category}
fr: Note dans {category}
kab: Tazmilt deg {category}

source: Add New Note
fr: Ajouter une nouvelle note
kab: Rnu tazmilt tamaynut

source: Note is encrypted
fr: La note est chiffrée
kab: Tazmilt tettwawgelhen

source: Encrypt note
fr: Chiffrer la note
kab: Awgelhen n tazmilt

# categoryLabel
source: Category
fr: Catégorie
kab: Taggayt

source: Unnamed
fr: Sans nom
kab: War isem

# pleaseSelectCategory
source: Please select a category
fr: Veuillez sélectionner une catégorie
kab: Ttxil-k fren taggayt

# categoryColon
source: Category: {name}
fr: Catégorie : {name}
kab: Taggayt: {name}

source: Background
fr: Arrière-plan
kab: Agilal

source: Title Color
fr: Couleur du titre
kab: Ini n uzwel

source: Title (Optional)
fr: Titre (facultatif)
kab: Azwel (afrayan)

source: Enter your note here...
fr: Saisissez votre note ici...
kab: Sekcem tazmilt-ik dagi...

source: Save Note
fr: Enregistrer la note
kab: Sekles tazmilt

# errorLoadingCategories
source: Error loading categories: {error}
fr: Erreur de chargement des catégories : {error}
kab: Tuccḍa deg usider n teggayin: {error}

source: Pick Note Background Color
fr: Choisir la couleur de fond de la note
kab: Fren ini n ugilal n tezm ilt

source: Pick Title Color
fr: Choisir la couleur du titre
kab: Fren ini n uzwel

source: Select
fr: Sélectionner
kab: Fren

# pleaseEnterContentBeforeEncrypting
source: Please enter some content before encrypting
fr: Veuillez entrer du contenu avant de chiffrer
kab: Ttxil-k sekcem agbur send awgelhen

source: Encrypt
fr: Chiffrer
kab: Awgelhen

source: Note encrypted successfully!
fr: Note chiffrée avec succès !
kab: Tazmilt tettwawgelhen akken iwata!

# encryptionError
source: Error: {error}
fr: Erreur : {error}
kab: Tuccḍa: {error}

# pleaseEnterTitle
source: Please enter a title
fr: Veuillez entrer un titre
kab: Ttxil-k sekcem azwel

# errorSavingNote
source: Error saving note: {error}
fr: Erreur d'enregistrement de la note : {error}
kab: Tuccḍa deg usekles n tezmilet: {error}

# tooManyFailedAttempts
source: Too many failed attempts. Please wait {minutes} minutes.
fr: Trop de tentatives échouées. Veuillez attendre {minutes} minutes.
kab: Aṭas n tirmitinin ur neǧǧi ara. Ttxil-k raǧu {minutes} n tesdat.

source: Decrypt Note
fr: Déchiffrer la note
kab: Kkes awgelhen n tezmilt

source: Enter Password to Decrypt
fr: Entrez le mot de passe pour déchiffrer
kab: Sekcem awal n uɛeddi i tuksa n uwgelhen

source: Please enter the password
fr: Veuillez entrer le mot de passe
kab: Ttxil-k sekcem awal n uɛeddi

# failedAttempts
source: Failed attempts: {current}/{max}
fr: Tentatives échouées : {current}/{max}
kab: Tirmitinin ur neǧǧin ara: {current}/{max}

source: Decrypt
fr: Déchiffrer
kab: Kkes awgelhen

source: Note decrypted successfully!
fr: Note déchiffrée avec succès !
kab: Awgelhen n tezmilt yettwakkes akken iwata!

# decryptionError
source: Error: {error}
fr: Erreur : {error}
kab: Tuccḍa: {error}

source: Note content cannot be empty.
fr: Le contenu de la note ne peut pas être vide.
kab: Agbur n tezmilet ur yezmir ara ad yili d ilem.

source: Note updated!
fr: Note mise à jour !
kab: Tazmilt tettwaleqqem!

source: Delete Note
fr: Supprimer la note
kab: Kkes tazmilt

# deleteNoteConfirmation
source: Are you sure you want to delete this note? This cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer cette note ? Cela ne peut pas être annulé.
kab: Tebɣiḍ s tidet ad tekkseḍ tazmilt-agi? Ur tezmir ara ad tettwasefsex.

source: Delete
fr: Supprimer
kab: Kkes

# errorDeletingNote
source: Error deleting note: {error}
fr: Erreur de suppression de la note : {error}
kab: Tuccḍa deg tukksa n tezmilet: {error}

# errorLoadingImages
source: Error loading images: {error}
fr: Erreur de chargement des images : {error}
kab: Tuccḍa deg usider n tugniwin: {error}

source: Image deleted successfully
fr: Image supprimée avec succès
kab: Tugna tettwakkes akken iwata

# errorDeletingImage
source: Error deleting image: {error}
fr: Erreur de suppression de l'image : {error}
kab: Tuccḍa deg tukksa n tugna: {error}

source: Close
fr: Fermer
kab: Mdel

# imageSavedTo
source: Image saved to: {path}
fr: Image enregistrée dans : {path}
kab: Tugna tettwasekles deg: {path}

# errorDownloadingImage
source: Error downloading image: {error}
fr: Erreur de téléchargement de l'image : {error}
kab: Tuccḍa deg usider n tugna: {error}

source: Attached Images
fr: Images jointes
kab: Tugniwin yeddan

source: Image(s) attached successfully!
fr: Image(s) jointe(s) avec succès !
kab: Tugna/tugniwin rnan akken iwata!

# errorAttachingImages
source: Error attaching image(s): {error}
fr: Erreur de jointure d'image(s) : {error}
kab: Tuccḍa deg tmerna n tugna/tugniwin: {error}

# titleLabel
source: Title
fr: Titre
kab: Azwel

source: Untitled
fr: Sans titre
kab: War azwel

source: Change Background Color
fr: Changer la couleur de fond
kab: Beddel ini n ugilal

source: Change Text Color
fr: Changer la couleur du texte
kab: Beddel ini n uḍris

source: Cancel Edit
fr: Annuler la modification
kab: Sefsex asnifel

source: Save Changes
fr: Enregistrer les modifications
kab: Sekles ibeddilen

source: Reset Database
fr: Réinitialiser la base de données
kab: Ales asbadu n taffa n yisefka

# resetDatabaseConfirmation
source: Are you sure you want to reset the database? This will delete all your notes and cannot be undone.
fr: Êtes-vous sûr de vouloir réinitialiser la base de données ? Cela supprimera toutes vos notes et ne peut pas être annulé.
kab: Tebɣiḍ s tidet ad talseḍ asbadu n taffa n yisefka? Ayagi ad yekkes akk tizmilin-ik ur yezmir ara ad yettwasefsex.

source: Reset
fr: Réinitialiser
kab: Ales asbadu

# failedToResetDatabase
source: Failed to reset database: {error}
fr: Échec de la réinitialisation de la base de données : {error}
kab: Ur yeddi ara walles n usebdu n taffa n yisefka: {error}

source: Unlock Custom Database
fr: Déverrouiller la base de données personnalisée
kab: Rmed taffa n yisefka yugnen

# enterPasswordCustomDb
source: Enter password for custom database:
fr: Entrez le mot de passe pour la base de données personnalisée :
kab: Sekcem awal n uɛeddi i taffa n yisefka yugnen:

source: Search Filters
fr: Filtres de recherche
kab: Imsizdigen n unadi

source: Select Date Range
fr: Sélectionner une plage de dates
kab: Fren azilal n wazemz

source: Filter by Category
fr: Filtrer par catégorie
kab: Sizdeg s teggayt

source: All Categories
fr: Toutes les catégories
kab: Akk taggayin

source: Clear All Filters
fr: Effacer tous les filtres
kab: Sfeḍ akk imsizdigen

source: Create New Entry
fr: Créer une nouvelle entrée
kab: Rnu anekcum amaynut

# entryNameLabel
source: Entry Name
fr: Nom de l'entrée
kab: Isem n unekcum

# enterEntryName
source: Enter a name for your entry
fr: Entrez un nom pour votre entrée
kab: Sekcem isem i unekcum-inek

# pleaseEnterName
source: Please enter a name
fr: Veuillez entrer un nom
kab: Ttxil-k sekcem isem

# errorCreatingEntry
source: Error creating entry: {error}
fr: Erreur de création de l'entrée : {error}
kab: Tuccḍa deg tmerna n unekcum: {error}

source: Delete Entry
fr: Supprimer l'entrée
kab: Kkes anekcum

# deleteEntryConfirmation
source: Are you sure you want to delete "{name}"? This will also delete all notes in this entry.
fr: Êtes-vous sûr de vouloir supprimer "{name}" ? Cela supprimera également toutes les notes de cette entrée.
kab: Tebɣiḍ s tidet ad tekkseḍ "{name}"? Ayagi ad yekkes daɣen akk tizmilin n unekcum-agi.

# errorDeletingEntry
source: Error deleting entry: {error}
fr: Erreur de suppression de l'entrée : {error}
kab: Tuccḍa deg tukksa n unekcum: {error}

source: Theme Settings
fr: Paramètres du thème
kab: Iɣewwaren n usentel

source: Switch to List View
fr: Passer à la vue en liste
kab: Ddu ɣer tmuɣli s tebdart

source: Switch to Grid View
fr: Passer à la vue en grille
kab: Ddu ɣer tmuɣli s tferrugt

source: Return to Welcome Screen
fr: Retour à l'écran d'accueil
kab: Uɣal ɣer ugdil n usenselkem

source: Unnamed Category
fr: Catégorie sans nom
kab: Taggayt war isem

# createdLabel
source: Created:
fr: Créé :
kab: Yettwarna:

source: No entries yet
fr: Aucune entrée pour le moment
kab: Ulac inekman s tura

# tapPlusButtonToCreate
source: Tap the + button to create your first entry
fr: Appuyez sur le bouton + pour créer votre première entrée
kab: Senned ɣef tqeffalt + i tmerna n unekcum-ik amezwaru

source: Create First Entry
fr: Créer la première entrée
kab: Rnu anekcum amezwaru

# lastModifiedLabel
source: Last modified:
fr: Dernière modification :
kab: Asnifel aneggaru:

source: Add New Entry
fr: Ajouter une nouvelle entrée
kab: Rnu anekcum amaynut

source: Entry name cannot be empty.
fr: Le nom de l'entrée ne peut pas être vide.
kab: Isem n unekcum ur yezmir ara ad yili d ilem.

source: Add
fr: Ajouter
kab: Rnu

# entryAddedWithId
source: Entry "{name}" added with ID: {id}.
fr: Entrée "{name}" ajoutée avec l'ID : {id}.
kab: Anekcum "{name}" yettwarnan s ID: {id}.

# failedToAddEntry
source: Failed to add entry: {error}
fr: Échec de l'ajout de l'entrée : {error}
kab: Ur yeddi ara rnu n unekcum: {error}

# editEntry
source: Edit Entry "{name}"
fr: Modifier l'entrée "{name}"
kab: Ẓreg anekcum "{name}"

# newEntryNameLabel
source: New Entry Name
fr: Nouveau nom d'entrée
kab: Isem amaynut n unekcum

# pleaseEnterDifferentName
source: Please enter a different name.
fr: Veuillez entrer un nom différent.
kab: Ttxil-k sekcem isem-nniḍen.

source: Update
fr: Mettre à jour
kab: Leqqem

# entryUpdatedTo
source: Entry "{oldName}" updated to "{newName}".
fr: Entrée "{oldName}" mise à jour en "{newName}".
kab: Anekcum "{oldName}" yettuleqqem ɣer "{newName}".

# failedToUpdateEntry
source: Failed to update entry: {error}
fr: Échec de la mise à jour de l'entrée : {error}
kab: Ur yeddi ara uleqqem n unekcum: {error}

# deleteEntryQuestion
source: Delete Entry?
fr: Supprimer l'entrée ?
kab: Kkes anekcum?

# deleteEntryAndNotesConfirmation
source: Are you sure you want to delete "{name}" and all its notes? This cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer "{name}" et toutes ses notes ? Cela ne peut pas être annulé.
kab: Tebɣiḍ s tidet ad tekkseḍ "{name}" d akk tizmilin-is? Ur yezmir ara ad yettwasefsex.

# entryDeleted
source: Entry "{name}" deleted
fr: Entrée "{name}" supprimée
kab: Anekcum "{name}" yettwakkes

# pleaseSelectEntryFirst
source: Please select an entry first.
fr: Veuillez d'abord sélectionner une entrée.
kab: Ttxil-k fren anekcum amezwaru.

# addNewNoteTo
source: Add New Note to "{name}"
fr: Ajouter une nouvelle note à "{name}"
kab: Rnu tazmilt tamaynut ɣer "{name}"

# noteContentLabel
source: Note Content
fr: Contenu de la note
kab: Agbur n tezmilet

# addNoteButton
source: Add Note
fr: Ajouter une note
kab: Rnu tazmilt

source: Note added successfully!
fr: Note ajoutée avec succès !
kab: Tazmilt tettwarna akken iwata!

# failedToAddNote
source: Failed to add note: {error}
fr: Échec de l'ajout de la note : {error}
kab: Ur yeddi ara tmerna n tezmilet: {error}

# todoEditNote
source: TODO: Edit Note {id}
fr: TODO : Modifier la note {id}
kab: TODO: Ẓreg tazmilt {id}

# deleteNoteQuestion
source: Delete Note?
fr: Supprimer la note ?
kab: Kkes tazmilt?

source: Note deleted
fr: Note supprimée
kab: Tazmilt tettwakkes

# rustDbTitle
source: Rust DB: {name}
fr: Base Rust : {name}
kab: Taffa Rust: {name}

source: Loading database...
fr: Chargement de la base de données...
kab: Asider n taffa n yisefka...

# errorLabel
source: Error
fr: Erreur
kab: Tuccḍa

source: Entries
fr: Entrées
kab: Inekman

source: No entries found
fr: Aucune entrée trouvée
kab: Ulac inekman

source: Notes
kab: Tizmilin

# noNotesFoundForMonth
source: No notes found for this month
fr: Aucune note trouvée pour ce mois
kab: Ulac tizmilin i waggur-agi

source: Refresh
fr: Actualiser
kab: Smiren

source: Theme Mode
fr: Mode de thème
kab: Anaw n usentel

# systemTheme
source: System
fr: Système
kab: Anagraw

# lightTheme
source: Light
fr: Clair
kab: Aceɛlal

# darkTheme
source: Dark
fr: Sombre
kab: Aberkan

source: Automatic Dark Mode
fr: Mode sombre automatique
kab: Anaw aberkan awurman

source: Enable time-based dark mode
fr: Activer le mode sombre basé sur l'heure
kab: Rmed anaw aberkan s wakud

# darkModeTimeBased
source: Dark mode between 19:00 and 06:00
fr: Mode sombre entre 19h00 et 06h00
kab: Anaw aberkan gar 19:00 d 06:00

source: My Notes
fr: Mes notes
kab: Tizmilin-inu

source: Welcome to My Notes
fr: Bienvenue dans Mes notes
kab: Anṣuf ɣer Tizmilin-inu

# yourPersonalNoteApplication
source: Your personal note-taking application
fr: Votre application personnelle de prise de notes
kab: Asnas-inek udmawan n tira n tizmilin

source: View Notes
fr: Voir les notes
kab: Ẓer tizmilin

source: Welcome
fr: Bienvenue
kab: Anṣuf

source: Application initialized successfully.
fr: Application initialisée avec succès.
kab: Asnas yettwasbadu akken iwata.

# continueButton
source: Continue
fr: Continuer
kab: Kemmel

# errorLoadingNotes
source: Error loading notes: {error}
fr: Erreur de chargement des notes : {error}
kab: Tuccḍa deg usider n tezmilin: {error}

source: No notes yet
fr: Aucune note pour le moment
kab: Ulac tizmilin s tura

# encryptedNoteLabel
source: [Encrypted Note]
fr: [Note chiffrée]
kab: [Tazmilt yettwawgelhen]
